load/artillery.yml
config:
  target: "http://router:8080"
  http:
    timeout: 300
  phases:
    - duration: 20
      arrivalRate: 2
      name: light-steady

scenarios:
  - name: chat-completions-via-router
    flow:
      - post:
          url: "/v1/chat/completions"
          headers:
            Content-Type: "application/json"
          json:
            model: "auto"
            messages:
              - role: "user"
                content: "ping"
            max_tokens: 8 # comment this line if you want to limit the max tokens (I do not suggest, it will take longer to complet the test).
            # since you just want to do a load test, so the answer here it doesn't matter. If you want to check the answer use BDD in a step definition 
            # scenario instead or validate something use TDD.